; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=12, locations=13, density=0.16666666666666666, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=26, seed=67

(define (problem transport-26)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l10)
    (at p3 l7)
    (at p4 l8)
    (at p5 l10)
    (at p6 l5)
    (at p7 l4)
    (at p8 l11)
    (at p9 l1)
    (at p10 l11)
    (at p11 l3)
    (at p12 l5)
    (at v1 l1)
    (at v2 l3)
    (at v3 l8)
    (at v4 l3)
    (at v5 l2)
    (road l12 l1)
    (road l5 l6)
    (road l10 l6)
    (road l3 l11)
    (road l9 l4)
    (road l13 l12)
    (road l6 l7)
    (road l4 l9)
    (road l13 l3)
    (road l12 l13)
    (road l7 l6)
    (road l6 l10)
    (road l10 l2)
    (road l10 l9)
    (road l3 l13)
    (road l9 l3)
    (road l2 l10)
    (road l9 l10)
    (road l3 l9)
    (road l6 l5)
    (road l1 l12)
    (road l8 l12)
    (road l11 l3)
    (road l12 l8)
    (road l3 l6)
    (road l6 l3)
    )
 (:goal  (and 
    (at p1 l10)
    (at p2 l5)
    (at p3 l13)
    (at p4 l5)
    (at p5 l11)
    (at p6 l4)
    (at p7 l9)
    (at p8 l1)
    (at p9 l8)
    (at p10 l10)
    (at p11 l9)
    (at p12 l1))))

; plan
1. (pick-up v1 l1 p9 c0 c1)
   deleted: (at p9 l1) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 0 of 12
2. (drive v1 l1 l12)
   deleted: (at v1 l1)
   added: (at v1 l12)
   goals met: 0 of 12
3. (drive v1 l12 l8)
   deleted: (at v1 l12)
   added: (at v1 l8)
   goals met: 0 of 12
4. (drop v1 l8 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l8) (capacity v1 c1)
   goals met: 1 of 12
5. (drive v2 l3 l6)
   deleted: (at v2 l3)
   added: (at v2 l6)
   goals met: 1 of 12
6. (drive v4 l3 l9)
   deleted: (at v4 l3)
   added: (at v4 l9)
   goals met: 1 of 12
7. (drive v4 l9 l4)
   deleted: (at v4 l9)
   added: (at v4 l4)
   goals met: 1 of 12
8. (pick-up v4 l4 p7 c1 c2)
   deleted: (at p7 l4) (capacity v4 c2)
   added: (in p7 v4) (capacity v4 c1)
   goals met: 1 of 12
9. (drive v4 l4 l9)
   deleted: (at v4 l4)
   added: (at v4 l9)
   goals met: 1 of 12
10. (drop v4 l9 p7 c1 c2)
   deleted: (in p7 v4) (capacity v4 c1)
   added: (at p7 l9) (capacity v4 c2)
   goals met: 2 of 12
11. (drive v4 l9 l3)
   deleted: (at v4 l9)
   added: (at v4 l3)
   goals met: 2 of 12
12. (drive v2 l6 l3)
   deleted: (at v2 l6)
   added: (at v2 l3)
   goals met: 2 of 12
13. (drive v2 l3 l13)
   deleted: (at v2 l3)
   added: (at v2 l13)
   goals met: 2 of 12
14. (pick-up v4 l3 p11 c1 c2)
   deleted: (at p11 l3) (capacity v4 c2)
   added: (in p11 v4) (capacity v4 c1)
   goals met: 2 of 12
15. (drive v4 l3 l9)
   deleted: (at v4 l3)
   added: (at v4 l9)
   goals met: 2 of 12
16. (drop v4 l9 p11 c1 c2)
   deleted: (in p11 v4) (capacity v4 c1)
   added: (at p11 l9) (capacity v4 c2)
   goals met: 3 of 12
17. (drive v4 l9 l10)
   deleted: (at v4 l9)
   added: (at v4 l10)
   goals met: 3 of 12
18. (pick-up v4 l10 p2 c1 c2)
   deleted: (at p2 l10) (capacity v4 c2)
   added: (in p2 v4) (capacity v4 c1)
   goals met: 3 of 12
19. (pick-up v4 l10 p5 c0 c1)
   deleted: (at p5 l10) (capacity v4 c1)
   added: (in p5 v4) (capacity v4 c0)
   goals met: 3 of 12
20. (drive v4 l10 l6)
   deleted: (at v4 l10)
   added: (at v4 l6)
   goals met: 3 of 12
21. (drive v4 l6 l3)
   deleted: (at v4 l6)
   added: (at v4 l3)
   goals met: 3 of 12
22. (drive v2 l13 l3)
   deleted: (at v2 l13)
   added: (at v2 l3)
   goals met: 3 of 12
23. (drive v4 l3 l11)
   deleted: (at v4 l3)
   added: (at v4 l11)
   goals met: 3 of 12
24. (drop v4 l11 p5 c0 c1)
   deleted: (in p5 v4) (capacity v4 c0)
   added: (at p5 l11) (capacity v4 c1)
   goals met: 4 of 12
25. (drive v4 l11 l3)
   deleted: (at v4 l11)
   added: (at v4 l3)
   goals met: 4 of 12
26. (drive v2 l3 l11)
   deleted: (at v2 l3)
   added: (at v2 l11)
   goals met: 4 of 12
27. (drive v4 l3 l13)
   deleted: (at v4 l3)
   added: (at v4 l13)
   goals met: 4 of 12
28. (pick-up v2 l11 p10 c0 c1)
   deleted: (at p10 l11) (capacity v2 c1)
   added: (in p10 v2) (capacity v2 c0)
   goals met: 4 of 12
29. (drive v4 l13 l3)
   deleted: (at v4 l13)
   added: (at v4 l3)
   goals met: 4 of 12
30. (drive v2 l11 l3)
   deleted: (at v2 l11)
   added: (at v2 l3)
   goals met: 4 of 12
31. (drive v2 l3 l9)
   deleted: (at v2 l3)
   added: (at v2 l9)
   goals met: 4 of 12
32. (drive v4 l3 l6)
   deleted: (at v4 l3)
   added: (at v4 l6)
   goals met: 4 of 12
33. (drive v2 l9 l10)
   deleted: (at v2 l9)
   added: (at v2 l10)
   goals met: 4 of 12
34. (drop v2 l10 p10 c0 c1)
   deleted: (in p10 v2) (capacity v2 c0)
   added: (at p10 l10) (capacity v2 c1)
   goals met: 5 of 12
35. (drive v4 l6 l5)
   deleted: (at v4 l6)
   added: (at v4 l5)
   goals met: 5 of 12
36. (drop v4 l5 p2 c1 c2)
   deleted: (in p2 v4) (capacity v4 c1)
   added: (at p2 l5) (capacity v4 c2)
   goals met: 6 of 12
37. (drive v2 l10 l6)
   deleted: (at v2 l10)
   added: (at v2 l6)
   goals met: 6 of 12
38. (drive v2 l6 l3)
   deleted: (at v2 l6)
   added: (at v2 l3)
   goals met: 6 of 12
39. (pick-up v4 l5 p1 c1 c2)
   deleted: (at p1 l5) (capacity v4 c2)
   added: (in p1 v4) (capacity v4 c1)
   goals met: 6 of 12
40. (drive v2 l3 l13)
   deleted: (at v2 l3)
   added: (at v2 l13)
   goals met: 6 of 12
41. (pick-up v4 l5 p6 c0 c1)
   deleted: (at p6 l5) (capacity v4 c1)
   added: (in p6 v4) (capacity v4 c0)
   goals met: 6 of 12
42. (drive v4 l5 l6)
   deleted: (at v4 l5)
   added: (at v4 l6)
   goals met: 6 of 12
43. (drive v4 l6 l10)
   deleted: (at v4 l6)
   added: (at v4 l10)
   goals met: 6 of 12
44. (drop v4 l10 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l10) (capacity v4 c1)
   goals met: 7 of 12
45. (drive v4 l10 l9)
   deleted: (at v4 l10)
   added: (at v4 l9)
   goals met: 7 of 12
46. (drive v4 l9 l4)
   deleted: (at v4 l9)
   added: (at v4 l4)
   goals met: 7 of 12
47. (drop v4 l4 p6 c1 c2)
   deleted: (in p6 v4) (capacity v4 c1)
   added: (at p6 l4) (capacity v4 c2)
   goals met: 8 of 12
48. (drive v2 l13 l3)
   deleted: (at v2 l13)
   added: (at v2 l3)
   goals met: 8 of 12
49. (drive v2 l3 l6)
   deleted: (at v2 l3)
   added: (at v2 l6)
   goals met: 8 of 12
50. (drive v2 l6 l7)
   deleted: (at v2 l6)
   added: (at v2 l7)
   goals met: 8 of 12
51. (pick-up v2 l7 p3 c0 c1)
   deleted: (at p3 l7) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 8 of 12
52. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 8 of 12
53. (drive v2 l7 l6)
   deleted: (at v2 l7)
   added: (at v2 l6)
   goals met: 8 of 12
54. (drive v2 l6 l3)
   deleted: (at v2 l6)
   added: (at v2 l3)
   goals met: 8 of 12
55. (drive v2 l3 l13)
   deleted: (at v2 l3)
   added: (at v2 l13)
   goals met: 8 of 12
56. (drop v2 l13 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l13) (capacity v2 c1)
   goals met: 9 of 12
57. (drive v2 l13 l12)
   deleted: (at v2 l13)
   added: (at v2 l12)
   goals met: 9 of 12
58. (drive v2 l12 l1)
   deleted: (at v2 l12)
   added: (at v2 l1)
   goals met: 9 of 12
59. (drive v1 l12 l1)
   deleted: (at v1 l12)
   added: (at v1 l1)
   goals met: 9 of 12
60. (pick-up v3 l8 p4 c1 c2)
   deleted: (at p4 l8) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 9 of 12
61. (drive v3 l8 l12)
   deleted: (at v3 l8)
   added: (at v3 l12)
   goals met: 9 of 12
62. (drive v3 l12 l13)
   deleted: (at v3 l12)
   added: (at v3 l13)
   goals met: 9 of 12
63. (drive v3 l13 l3)
   deleted: (at v3 l13)
   added: (at v3 l3)
   goals met: 9 of 12
64. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 9 of 12
65. (drive v3 l6 l5)
   deleted: (at v3 l6)
   added: (at v3 l5)
   goals met: 9 of 12
66. (pick-up v3 l5 p12 c0 c1)
   deleted: (at p12 l5) (capacity v3 c1)
   added: (in p12 v3) (capacity v3 c0)
   goals met: 9 of 12
67. (drop v3 l5 p4 c0 c1)
   deleted: (in p4 v3) (capacity v3 c0)
   added: (at p4 l5) (capacity v3 c1)
   goals met: 10 of 12
68. (drive v3 l5 l6)
   deleted: (at v3 l5)
   added: (at v3 l6)
   goals met: 10 of 12
69. (drive v3 l6 l3)
   deleted: (at v3 l6)
   added: (at v3 l3)
   goals met: 10 of 12
70. (drive v3 l3 l11)
   deleted: (at v3 l3)
   added: (at v3 l11)
   goals met: 10 of 12
71. (pick-up v3 l11 p8 c0 c1)
   deleted: (at p8 l11) (capacity v3 c1)
   added: (in p8 v3) (capacity v3 c0)
   goals met: 10 of 12
72. (drive v3 l11 l3)
   deleted: (at v3 l11)
   added: (at v3 l3)
   goals met: 10 of 12
73. (drive v3 l3 l13)
   deleted: (at v3 l3)
   added: (at v3 l13)
   goals met: 10 of 12
74. (drive v3 l13 l12)
   deleted: (at v3 l13)
   added: (at v3 l12)
   goals met: 10 of 12
75. (drive v3 l12 l1)
   deleted: (at v3 l12)
   added: (at v3 l1)
   goals met: 10 of 12
76. (drop v3 l1 p12 c0 c1)
   deleted: (in p12 v3) (capacity v3 c0)
   added: (at p12 l1) (capacity v3 c1)
   goals met: 11 of 12
77. (drop v3 l1 p8 c1 c2)
   deleted: (in p8 v3) (capacity v3 c1)
   added: (at p8 l1) (capacity v3 c2)
   goals met: 12 of 12
